grevaillot/svd_tools/headers/STM32H7x5_CM4/gpioc.h
#define GPIOC_PUPDR_PUPD9_SHIFT		18
#define GPIOC_PUPDR_PUPD9_MASK		0x03
/** @defgroup gpioc_pupdr_pupd9 PUPD9 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOC_PUPDR_PUPD8_SHIFT		16
#define GPIOC_PUPDR_PUPD8_MASK		0x03
/** @defgroup gpioc_pupdr_pupd8 PUPD8 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOC_PUPDR_PUPD7_SHIFT		14
#define GPIOC_PUPDR_PUPD7_MASK		0x03
/** @defgroup gpioc_pupdr_pupd7 PUPD7 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOC_PUPDR_PUPD6_SHIFT		12
#define GPIOC_PUPDR_PUPD6_MASK		0x03
/** @defgroup gpioc_pupdr_pupd6 PUPD6 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOC_PUPDR_PUPD5_SHIFT		10
#define GPIOC_PUPDR_PUPD5_MASK		0x03
/** @defgroup gpioc_pupdr_pupd5 PUPD5 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOC_PUPDR_PUPD4_SHIFT		8
#define GPIOC_PUPDR_PUPD4_MASK		0x03
/** @defgroup gpioc_pupdr_pupd4 PUPD4 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOC_PUPDR_PUPD3_SHIFT		6
#define GPIOC_PUPDR_PUPD3_MASK		0x03
/** @defgroup gpioc_pupdr_pupd3 PUPD3 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOC_PUPDR_PUPD2_SHIFT		4
#define GPIOC_PUPDR_PUPD2_MASK		0x03
/** @defgroup gpioc_pupdr_pupd2 PUPD2 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOC_PUPDR_PUPD1_SHIFT		2
#define GPIOC_PUPDR_PUPD1_MASK		0x03
/** @defgroup gpioc_pupdr_pupd1 PUPD1 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOC_PUPDR_PUPD0_SHIFT		0
#define GPIOC_PUPDR_PUPD0_MASK		0x03
/** @defgroup gpioc_pupdr_pupd0 PUPD0 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioc_idr IDR GPIO port input data register
@{*/

/** GPIOC_IDR_ID15 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID15		(1 << 15)
/** GPIOC_IDR_ID14 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID14		(1 << 14)
/** GPIOC_IDR_ID13 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID13		(1 << 13)
/** GPIOC_IDR_ID12 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID12		(1 << 12)
/** GPIOC_IDR_ID11 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID11		(1 << 11)
/** GPIOC_IDR_ID10 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID10		(1 << 10)
/** GPIOC_IDR_ID9 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID9		(1 << 9)
/** GPIOC_IDR_ID8 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID8		(1 << 8)
/** GPIOC_IDR_ID7 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID7		(1 << 7)
/** GPIOC_IDR_ID6 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID6		(1 << 6)
/** GPIOC_IDR_ID5 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID5		(1 << 5)
/** GPIOC_IDR_ID4 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID4		(1 << 4)
/** GPIOC_IDR_ID3 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID3		(1 << 3)
/** GPIOC_IDR_ID2 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID2		(1 << 2)
/** GPIOC_IDR_ID1 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID1		(1 << 1)
/** GPIOC_IDR_ID0 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOC_IDR_ID0		(1 << 0)

/**@}*/

/** @defgroup gpioc_odr ODR GPIO port output data register
@{*/

/** GPIOC_ODR_OD15 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD15		(1 << 15)
/** GPIOC_ODR_OD14 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD14		(1 << 14)
/** GPIOC_ODR_OD13 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD13		(1 << 13)
/** GPIOC_ODR_OD12 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD12		(1 << 12)
/** GPIOC_ODR_OD11 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD11		(1 << 11)
/** GPIOC_ODR_OD10 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD10		(1 << 10)
/** GPIOC_ODR_OD9 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD9		(1 << 9)
/** GPIOC_ODR_OD8 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD8		(1 << 8)
/** GPIOC_ODR_OD7 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD7		(1 << 7)
/** GPIOC_ODR_OD6 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD6		(1 << 6)
/** GPIOC_ODR_OD5 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD5		(1 << 5)
/** GPIOC_ODR_OD4 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD4		(1 << 4)
/** GPIOC_ODR_OD3 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD3		(1 << 3)
/** GPIOC_ODR_OD2 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD2		(1 << 2)
/** GPIOC_ODR_OD1 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD1		(1 << 1)
/** GPIOC_ODR_OD0 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOC_ODR_OD0		(1 << 0)

/**@}*/

/** @defgroup gpioc_bsrr BSRR GPIO port bit set/reset register
@{*/

/** GPIOC_BSRR_BR15 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR15		(1 << 31)
/** GPIOC_BSRR_BR14 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR14		(1 << 30)
/** GPIOC_BSRR_BR13 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR13		(1 << 29)
/** GPIOC_BSRR_BR12 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR12		(1 << 28)
/** GPIOC_BSRR_BR11 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR11		(1 << 27)
/** GPIOC_BSRR_BR10 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR10		(1 << 26)
/** GPIOC_BSRR_BR9 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR9		(1 << 25)
/** GPIOC_BSRR_BR8 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR8		(1 << 24)
/** GPIOC_BSRR_BR7 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR7		(1 << 23)
/** GPIOC_BSRR_BR6 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR6		(1 << 22)
/** GPIOC_BSRR_BR5 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR5		(1 << 21)
/** GPIOC_BSRR_BR4 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR4		(1 << 20)
/** GPIOC_BSRR_BR3 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR3		(1 << 19)
/** GPIOC_BSRR_BR2 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR2		(1 << 18)
/** GPIOC_BSRR_BR1 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR1		(1 << 17)
/** GPIOC_BSRR_BR0 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOC_BSRR_BR0		(1 << 16)
/** GPIOC_BSRR_BS15 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS15		(1 << 15)
/** GPIOC_BSRR_BS14 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS14		(1 << 14)
/** GPIOC_BSRR_BS13 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS13		(1 << 13)
/** GPIOC_BSRR_BS12 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS12		(1 << 12)
/** GPIOC_BSRR_BS11 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS11		(1 << 11)
/** GPIOC_BSRR_BS10 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS10		(1 << 10)
/** GPIOC_BSRR_BS9 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS9		(1 << 9)
/** GPIOC_BSRR_BS8 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS8		(1 << 8)
/** GPIOC_BSRR_BS7 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS7		(1 << 7)
/** GPIOC_BSRR_BS6 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS6		(1 << 6)
/** GPIOC_BSRR_BS5 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS5		(1 << 5)
/** GPIOC_BSRR_BS4 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS4		(1 << 4)
/** GPIOC_BSRR_BS3 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS3		(1 << 3)
/** GPIOC_BSRR_BS2 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS2		(1 << 2)
/** GPIOC_BSRR_BS1 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS1		(1 << 1)
/** GPIOC_BSRR_BS0 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOC_BSRR_BS0		(1 << 0)

/**@}*/

/** @defgroup gpioc_lckr LCKR This register is used to lock the configuration of the port bits when a correct write sequence is applied to bit 16 (LCKK). The value of bits [15:0] is used to lock the configuration of the GPIO. During the write sequence, the value of LCKR[15:0] must not change. When the LOCK sequence has been applied on a port bit, the value of this port bit can no longer be modified until the next MCU reset or peripheral reset.A specific write sequence is used to write to the GPIOx_LCKR register. Only word access (32-bit long) is allowed during this locking sequence.Each lock bit freezes a specific configuration register (control and alternate function registers).
@{*/

/** GPIOC_LCKR_LCKK Lock key This bit can be read any time. It can only be modified using the lock key write sequence. LOCK key write sequence: WR LCKR[16] = 1 + LCKR[15:0] WR LCKR[16] = 0 + LCKR[15:0] WR LCKR[16] = 1 + LCKR[15:0] RD LCKR RD LCKR[16] = 1 (this read operation is optional but it confirms that the lock is active) Note: During the LOCK key write sequence, the value of LCK[15:0] must not change. Any error in the lock sequence aborts the lock. After the first lock sequence on any bit of the port, any read access on the LCKK bit will return 1 until the next MCU reset or peripheral reset. **/
#define GPIOC_LCKR_LCKK		(1 << 16)
/** GPIOC_LCKR_LCK15 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK15		(1 << 15)
/** GPIOC_LCKR_LCK14 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK14		(1 << 14)
/** GPIOC_LCKR_LCK13 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK13		(1 << 13)
/** GPIOC_LCKR_LCK12 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK12		(1 << 12)
/** GPIOC_LCKR_LCK11 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK11		(1 << 11)
/** GPIOC_LCKR_LCK10 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK10		(1 << 10)
/** GPIOC_LCKR_LCK9 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK9		(1 << 9)
/** GPIOC_LCKR_LCK8 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK8		(1 << 8)
/** GPIOC_LCKR_LCK7 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK7		(1 << 7)
/** GPIOC_LCKR_LCK6 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK6		(1 << 6)
/** GPIOC_LCKR_LCK5 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK5		(1 << 5)
/** GPIOC_LCKR_LCK4 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK4		(1 << 4)
/** GPIOC_LCKR_LCK3 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK3		(1 << 3)
/** GPIOC_LCKR_LCK2 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK2		(1 << 2)
/** GPIOC_LCKR_LCK1 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK1		(1 << 1)
/** GPIOC_LCKR_LCK0 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOC_LCKR_LCK0		(1 << 0)

/**@}*/

/** @defgroup gpioc_afrl AFRL GPIO alternate function low register
@{*/


#define GPIOC_AFRL_AFSEL7_SHIFT		28
#define GPIOC_AFRL_AFSEL7_MASK		0x0f
/** @defgroup gpioc_afrl_afsel7 AFSEL7 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOC_AFRL_AFSEL6_SHIFT		24
#define GPIOC_AFRL_AFSEL6_MASK		0x0f
/** @defgroup gpioc_afrl_afsel6 AFSEL6 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOC_AFRL_AFSEL5_SHIFT		20
#define GPIOC_AFRL_AFSEL5_MASK		0x0f
/** @defgroup gpioc_afrl_afsel5 AFSEL5 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOC_AFRL_AFSEL4_SHIFT		16
#define GPIOC_AFRL_AFSEL4_MASK		0x0f
/** @defgroup gpioc_afrl_afsel4 AFSEL4 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOC_AFRL_AFSEL3_SHIFT		12
#define GPIOC_AFRL_AFSEL3_MASK		0x0f
/** @defgroup gpioc_afrl_afsel3 AFSEL3 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOC_AFRL_AFSEL2_SHIFT		8
#define GPIOC_AFRL_AFSEL2_MASK		0x0f
/** @defgroup gpioc_afrl_afsel2 AFSEL2 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOC_AFRL_AFSEL1_SHIFT		4
#define GPIOC_AFRL_AFSEL1_MASK		0x0f
/** @defgroup gpioc_afrl_afsel1 AFSEL1 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


