grevaillot/svd_tools/headers/STM32H7x5_CM4/gpioc.h
#define GPIOC_AFRL_AFSEL0_SHIFT		0
#define GPIOC_AFRL_AFSEL0_MASK		0x0f
/** @defgroup gpioc_afrl_afsel0 AFSEL0 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioc_afrh AFRH GPIO alternate function high register
@{*/


#define GPIOC_AFRH_AFSEL15_SHIFT		28
#define GPIOC_AFRH_AFSEL15_MASK		0x0f
/** @defgroup gpioc_afrh_afsel15 AFSEL15 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOC_AFRH_AFSEL14_SHIFT		24
#define GPIOC_AFRH_AFSEL14_MASK		0x0f
/** @defgroup gpioc_afrh_afsel14 AFSEL14 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOC_AFRH_AFSEL13_SHIFT		20
#define GPIOC_AFRH_AFSEL13_MASK		0x0f
/** @defgroup gpioc_afrh_afsel13 AFSEL13 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOC_AFRH_AFSEL12_SHIFT		16
#define GPIOC_AFRH_AFSEL12_MASK		0x0f
/** @defgroup gpioc_afrh_afsel12 AFSEL12 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOC_AFRH_AFSEL11_SHIFT		12
#define GPIOC_AFRH_AFSEL11_MASK		0x0f
/** @defgroup gpioc_afrh_afsel11 AFSEL11 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOC_AFRH_AFSEL10_SHIFT		8
#define GPIOC_AFRH_AFSEL10_MASK		0x0f
/** @defgroup gpioc_afrh_afsel10 AFSEL10 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOC_AFRH_AFSEL9_SHIFT		4
#define GPIOC_AFRH_AFSEL9_MASK		0x0f
/** @defgroup gpioc_afrh_afsel9 AFSEL9 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


#define GPIOC_AFRH_AFSEL8_SHIFT		0
#define GPIOC_AFRH_AFSEL8_MASK		0x0f
/** @defgroup gpioc_afrh_afsel8 AFSEL8 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


/**@}*/
